[
  {
    "id": 1,
    "name": "ReactTube",
    "description": "ReactTube is a cutting-edge video streaming platform built with React.js and Redux for a seamless user experience. Designed for high performance and speed, ReactTube offers fast loading times to keep you engaged with minimal wait. The platform incorporates sophisticated debouncing techniques to handle user interactions efficiently and ensure smooth video playback.",
    "features": [
      {
        "name": "Responsive Design",
        "detail": "Whether on desktop, tablet, or mobile, ReactTube provides a flawless viewing experience across all devices."
      },
      {
        "name": "Responsive Design",
        "detail": "Enjoy a sleek, modern interface with an optional dark theme that's easy on the eyes, perfect for extended viewing sessions."
      },
      { 
        "name": "Live Chats",
        "detail": "Engage with real-time discussions and interactions through live Chat on your favorite videos."
      },
      {
        "name": "Real YouTube APIs",
        "detail": "Integrated with authentic YouTube APIs, ReactTube pulls in accurate data and delivers content directly from YouTube vast library."
      }
    ],
    "summary": "ReactTube blends performance, functionality, and a contemporary design to create an exceptional video streaming experience.",
    "github": "",
    "liveLink": "",
    "imageLink": "https://raw.githubusercontent.com/Ninad-arakh/React-Pr/master/ReactTube.png"
  },
  {
    "id": 2,
    "name": "ReactFlix",
    "description": "ReactFlix is a high-performance video streaming platform designed with React.js and Redux for a smooth, interactive user experience. It offers rapid content loading to keep you engaged without unnecessary delays.",
    "features": [
      {
        "name": "Account Authentication",
        "detail": "Seamlessly sign up or sign in to manage your profile and access personalized content."
      },
      {
        "name": "Responsive Design",
        "detail": "Enjoy a consistent and optimized viewing experience on any device, from desktops to smartphones."
      },
      {
        "name": "Search Functionality",
        "detail": "Easily find your favorite movies and shows with an intuitive search feature."
      },
      {
        "name": "Real APIs Integration",
        "detail": "Utilizes authentic APIs to provide up-to-date and accurate content, ensuring a reliable streaming experience."
      }
    ],
    "summary": "ReactFlix combines cutting-edge technology with user-centric features to deliver a modern, efficient, and engaging video streaming service.",

    "github": "",
    "liveLink": "",
    "imageLink": "https://raw.githubusercontent.com/Ninad-arakh/React-Pr/master/ReactFlix.png"
  },
  {
    "id": 3,
    "name": "LoginVista",
    "description": "LoginVista is an elegantly designed login page built using just HTML, CSS, and JavaScript. This minimalist yet visually interface focuses on providing a seamless and stylish user authentication experience.",
    "features": [
      {
        "name": "Account Authentication",
        "detail": "Seamlessly sign up or sign in to manage your profile and access personalized content."
      },
      {
        "name": "Responsive Design",
        "detail": "Enjoy a consistent and optimized viewing experience on any device, from desktops to smartphones."
      },
      {
        "name": "Search Functionality",
        "detail": "Easily find your favorite movies and shows with an intuitive search feature."
      },
      {
        "name": "Real APIs Integration",
        "detail": "Utilizes authentic APIs to provide up-to-date and accurate content, ensuring a reliable streaming experience."
      }
    ],
    "summary": "ReactFlix combines cutting-edge technology with user-centric features to deliver a modern, efficient, and engaging video streaming service.",

    "github": "",
    "liveLink": "",
    "imageLink": "https://raw.githubusercontent.com/Ninad-arakh/React-Pr/master/loginVista.png"
  }
]
